{
  "date": "2025-12-28",
  "firstReading": {
    "en": {
      "title": "Isaiah 9:1-6",
      "text": "The people who walked in darkness have seen a great light; upon those who dwelt in the land of gloom a light has shone. You have brought them abundant joy and great rejoicing, as they rejoice before you as at the harvest, as people make merry when dividing spoils. For the yoke that burdened them, the pole on their shoulder, and the rod of their taskmaster you have smashed, as on the day of Midian. For every boot that tramped in battle, every cloak rolled in blood, will be burned as fuel for flames. For a child is born to us, a son is given us; upon his shoulder dominion rests. They name him Wonder-Counselor, God-Hero, Father-Forever, Prince of Peace. His dominion is vast and forever peaceful, from David’s throne, and over his kingdom, which he confirms and sustains by judgment and justice, both now and forever. The zeal of the LORD of hosts will do this!"
    },
    "sw": {
      "title": "Isaya 9:1-6",
      "text": "Watu waliokuwa wakitembea gizani wameona nuru kuu; juu ya wale waliokaa katika nchi ya giza nuru imewaangazia. Umeongeza furaha yao na kuwapa shangwe kubwa, kama vile watu wafurahivyo wakati wa mavuno, kama vile wafanyavyo shangwe wakati wa kugawana nyara. Kwa maana nira iliyowalemea, na fimbo ya mgongoni mwao, na gongo la mwenye kuwatesa, umevifedhehesha kama siku ya Midiani. Kwa maana kila buti ya askari aliye katika vita, na kila vazi lililoloweshwa damu, vitateketezwa na kuwa kuni za moto. Kwa maana mtoto amezaliwa kwetu, mwana amepewa kwetu; na mamlaka yatakuwa mabegani mwake; naye ataitwa jina lake Mshauri wa Ajabu, Mungu Mwenye Nguvu, Baba wa Milele, Mfalme wa Amani. Ufalme wake utakuwa mkubwa na amani haitakuwa na mwisho, juu ya kiti cha enzi cha Daudi na juu ya ufalme wake, kuuthibitisha na kuutegemeza kwa hukumu na haki, tangu sasa na hata milele. Wivu wa Bwana wa majeshi utatimiza haya!"
    }
  },
  "psalm": {
    "en": {
      "title": "Psalm 96:1-2, 2-3, 11-12, 13",
      "text": "R. Today is born our Savior, Christ the Lord.\nSing to the LORD a new song; sing to the LORD, all you lands. Sing to the LORD; bless his name.\nR. Today is born our Savior, Christ the Lord.\nAnnounce his salvation, day after day. Tell his glory among the nations; among all peoples, his wondrous deeds.\nR. Today is born our Savior, Christ the Lord.\nLet the heavens be glad and the earth rejoice; let the sea and what fills it resound; let the plains be joyful and all that is in them! Then shall all the trees of the forest exult.\nR. Today is born our Savior, Christ the Lord.\nBefore the LORD, for he comes; for he comes to rule the earth. He shall rule the world with justice and the peoples with his constancy.\nR. Today is born our Savior, Christ the Lord."
    },
    "sw": {
      "title": "Zaburi 96:1-2, 2-3, 11-12, 13",
      "text": "R. Leo amezaliwa Mwokozi wetu, Kristo Bwana.\nMwimbieni BWANA wimbo mpya; mwimbieni BWANA, dunia yote. Mwimbieni BWANA, barikini jina lake.\nR. Leo amezaliwa Mwokozi wetu, Kristo Bwana.\nTangazeni wokovu wake siku baada ya siku. Tangazeni utukufu wake kati ya mataifa; kati ya watu wote matendo yake ya ajabu.\nR. Leo amezaliwa Mwokozi wetu, Kristo Bwana.\nMbingu na ifurahi, nchi na ishange; bahari na vyote viijazavyo vishangilie; mashamba na vyote vilivyomo vifurahi! Ndipo miti yote ya msitu itashangilia.\nR. Leo amezaliwa Mwokozi wetu, Kristo Bwana.\nMbele za BWANA, kwa maana anakuja; anakuja kuhukumu dunia. Atahukumu dunia kwa haki na watu kwa uaminifu wake.\nR. Leo amezaliwa Mwokozi wetu, Kristo Bwana."
    }
  },
  "gospel": {
    "en": {
      "title": "Luke 2:1-14",
      "text": "In those days a decree went out from Caesar Augustus that the whole world should be enrolled. This was the first enrollment, when Quirinius was governor of Syria. So all went to be enrolled, each to his own town. And Joseph too went up from Galilee from the town of Nazareth to Judea, to the city of David that is called Bethlehem, because he was of the house and family of David, to be enrolled with Mary, his betrothed, who was with child. While they were there, the time came for her to have her child, and she gave birth to her firstborn son. She wrapped him in swaddling clothes and laid him in a manger, because there was no room for them in the inn. Now there were shepherds in that region living in the fields and keeping the night watch over their flock. The angel of the Lord appeared to them and the glory of the Lord shone around them, and they were struck with great fear. The angel said to them, “Do not be afraid; for behold, I proclaim to you good news of great joy that will be for all the people. For today in the city of David a savior has been born for you who is Christ and Lord. And this will be a sign for you: you will find an infant wrapped in swaddling clothes and lying in a manger.” And suddenly there was a multitude of the heavenly host with the angel, praising God and saying: “Glory to God in the highest and on earth peace to those on whom his favor rests.”"
    },
    "sw": {
      "title": "Luka 2:1-14",
      "text": "Siku zile, amri ilitoka kwa Kaisari Augusto kwamba dunia yote iandikwe. Hii ilikuwa kuandikishwa kwa kwanza, wakati Kirinio alikuwa liwali wa Siria. Wote walikwenda kuandikishwa, kila mmoja katika mji wake. Yusufu naye akatoka Galilaya, kutoka mji wa Nazareti, kwenda Yudea, katika mji wa Daudi uitwao Bethlehemu, kwa sababu alikuwa wa nyumba na ukoo wa Daudi, ili aandikishwe pamoja na Maria, aliyekuwa ameposwa naye, ambaye alikuwa mjamzito. Walipokuwa huko, wakati wa Maria kujifungua ulifika, akazaa mwanawe, kifungua mimba, akamvika nguo za kitoto na kumlaza katika hori ya ng’ombe, kwa kuwa hapakuwa na nafasi kwao katika nyumba ya wageni. Palikuwa na wachungaji katika nchi ile, wakikesha usiku wakilinda makundi yao. Malaika wa Bwana akawatokea, utukufu wa Bwana ukawaangazia, wakaogopa sana. Malaika akawaambia, “Msiogope; maana, tazama, nawatangazia habari njema ya furaha kuu itakayokuwa kwa watu wote. Maana leo katika mji wa Daudi amezaliwa kwa ajili yenu Mwokozi, ndiye Kristo Bwana. Na hii itakuwa ishara kwenu: mtamkuta mtoto amevikwa nguo za kitoto amelala katika hori ya ng’ombe.” Mara jeshi kubwa la mbinguni likatokea pamoja na malaika, wakimsifu Mungu na kusema: “Atukuzwe Mungu juu mbinguni, na duniani iwe amani kwa watu aliowaridhia.”"
    }
  },
  "source": "https://bible.usccb.org/bible/readings/122525.cfm"
}